MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAA288/mcu.h
extern volatile __C1FIFOINT25bits_t C1FIFOINT25bits __asm__ ("C1FIFOINT25") __attribute__((section("sfrs"), address(0xBF8809A0)));
extern volatile uint32_t        C1FIFOINT25CLR __attribute__((section("sfrs"),address(0xBF8809A4)));
extern volatile uint32_t        C1FIFOINT25SET __attribute__((section("sfrs"),address(0xBF8809A8)));
extern volatile uint32_t        C1FIFOINT25INV __attribute__((section("sfrs"),address(0xBF8809AC)));
#define C1FIFOUA25 C1FIFOUA25
extern volatile uint32_t   C1FIFOUA25 __attribute__((section("sfrs"), address(0xBF8809B0)));
extern volatile uint32_t        C1FIFOUA25CLR __attribute__((section("sfrs"),address(0xBF8809B4)));
extern volatile uint32_t        C1FIFOUA25SET __attribute__((section("sfrs"),address(0xBF8809B8)));
extern volatile uint32_t        C1FIFOUA25INV __attribute__((section("sfrs"),address(0xBF8809BC)));
#define C1FIFOCI25 C1FIFOCI25
extern volatile uint32_t   C1FIFOCI25 __attribute__((section("sfrs"), address(0xBF8809C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI25bits_t;
extern volatile __C1FIFOCI25bits_t C1FIFOCI25bits __asm__ ("C1FIFOCI25") __attribute__((section("sfrs"), address(0xBF8809C0)));
extern volatile uint32_t        C1FIFOCI25CLR __attribute__((section("sfrs"),address(0xBF8809C4)));
extern volatile uint32_t        C1FIFOCI25SET __attribute__((section("sfrs"),address(0xBF8809C8)));
extern volatile uint32_t        C1FIFOCI25INV __attribute__((section("sfrs"),address(0xBF8809CC)));
#define C1FIFOCON26 C1FIFOCON26
extern volatile uint32_t   C1FIFOCON26 __attribute__((section("sfrs"), address(0xBF8809D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON26bits_t;
extern volatile __C1FIFOCON26bits_t C1FIFOCON26bits __asm__ ("C1FIFOCON26") __attribute__((section("sfrs"), address(0xBF8809D0)));
extern volatile uint32_t        C1FIFOCON26CLR __attribute__((section("sfrs"),address(0xBF8809D4)));
extern volatile uint32_t        C1FIFOCON26SET __attribute__((section("sfrs"),address(0xBF8809D8)));
extern volatile uint32_t        C1FIFOCON26INV __attribute__((section("sfrs"),address(0xBF8809DC)));
#define C1FIFOINT26 C1FIFOINT26
extern volatile uint32_t   C1FIFOINT26 __attribute__((section("sfrs"), address(0xBF8809E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT26bits_t;
extern volatile __C1FIFOINT26bits_t C1FIFOINT26bits __asm__ ("C1FIFOINT26") __attribute__((section("sfrs"), address(0xBF8809E0)));
extern volatile uint32_t        C1FIFOINT26CLR __attribute__((section("sfrs"),address(0xBF8809E4)));
extern volatile uint32_t        C1FIFOINT26SET __attribute__((section("sfrs"),address(0xBF8809E8)));
extern volatile uint32_t        C1FIFOINT26INV __attribute__((section("sfrs"),address(0xBF8809EC)));
#define C1FIFOUA26 C1FIFOUA26
extern volatile uint32_t   C1FIFOUA26 __attribute__((section("sfrs"), address(0xBF8809F0)));
extern volatile uint32_t        C1FIFOUA26CLR __attribute__((section("sfrs"),address(0xBF8809F4)));
extern volatile uint32_t        C1FIFOUA26SET __attribute__((section("sfrs"),address(0xBF8809F8)));
extern volatile uint32_t        C1FIFOUA26INV __attribute__((section("sfrs"),address(0xBF8809FC)));
#define C1FIFOCI26 C1FIFOCI26
extern volatile uint32_t   C1FIFOCI26 __attribute__((section("sfrs"), address(0xBF880A00)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI26bits_t;
extern volatile __C1FIFOCI26bits_t C1FIFOCI26bits __asm__ ("C1FIFOCI26") __attribute__((section("sfrs"), address(0xBF880A00)));
extern volatile uint32_t        C1FIFOCI26CLR __attribute__((section("sfrs"),address(0xBF880A04)));
extern volatile uint32_t        C1FIFOCI26SET __attribute__((section("sfrs"),address(0xBF880A08)));
extern volatile uint32_t        C1FIFOCI26INV __attribute__((section("sfrs"),address(0xBF880A0C)));
#define C1FIFOCON27 C1FIFOCON27
extern volatile uint32_t   C1FIFOCON27 __attribute__((section("sfrs"), address(0xBF880A10)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON27bits_t;
extern volatile __C1FIFOCON27bits_t C1FIFOCON27bits __asm__ ("C1FIFOCON27") __attribute__((section("sfrs"), address(0xBF880A10)));
extern volatile uint32_t        C1FIFOCON27CLR __attribute__((section("sfrs"),address(0xBF880A14)));
extern volatile uint32_t        C1FIFOCON27SET __attribute__((section("sfrs"),address(0xBF880A18)));
extern volatile uint32_t        C1FIFOCON27INV __attribute__((section("sfrs"),address(0xBF880A1C)));
#define C1FIFOINT27 C1FIFOINT27
extern volatile uint32_t   C1FIFOINT27 __attribute__((section("sfrs"), address(0xBF880A20)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT27bits_t;
