MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAA288/mcu.h
#define _CNNEC_CNNEC2_POSITION                   0x00000002
#define _CNNEC_CNNEC2_MASK                       0x00000004
#define _CNNEC_CNNEC2_LENGTH                     0x00000001

#define _CNNEC_CNNEC3_POSITION                   0x00000003
#define _CNNEC_CNNEC3_MASK                       0x00000008
#define _CNNEC_CNNEC3_LENGTH                     0x00000001

#define _CNNEC_CNNEC4_POSITION                   0x00000004
#define _CNNEC_CNNEC4_MASK                       0x00000010
#define _CNNEC_CNNEC4_LENGTH                     0x00000001

#define _CNNEC_CNNEC12_POSITION                  0x0000000C
#define _CNNEC_CNNEC12_MASK                      0x00001000
#define _CNNEC_CNNEC12_LENGTH                    0x00000001

#define _CNNEC_CNNEC13_POSITION                  0x0000000D
#define _CNNEC_CNNEC13_MASK                      0x00002000
#define _CNNEC_CNNEC13_LENGTH                    0x00000001

#define _CNNEC_CNNEC14_POSITION                  0x0000000E
#define _CNNEC_CNNEC14_MASK                      0x00004000
#define _CNNEC_CNNEC14_LENGTH                    0x00000001

#define _CNNEC_CNNEC15_POSITION                  0x0000000F
#define _CNNEC_CNNEC15_MASK                      0x00008000
#define _CNNEC_CNNEC15_LENGTH                    0x00000001

#define _CNFC_CNFC1_POSITION                     0x00000001
#define _CNFC_CNFC1_MASK                         0x00000002
#define _CNFC_CNFC1_LENGTH                       0x00000001

#define _CNFC_CNFC2_POSITION                     0x00000002
#define _CNFC_CNFC2_MASK                         0x00000004
#define _CNFC_CNFC2_LENGTH                       0x00000001

#define _CNFC_CNFC3_POSITION                     0x00000003
#define _CNFC_CNFC3_MASK                         0x00000008
#define _CNFC_CNFC3_LENGTH                       0x00000001

#define _CNFC_CNFC4_POSITION                     0x00000004
#define _CNFC_CNFC4_MASK                         0x00000010
#define _CNFC_CNFC4_LENGTH                       0x00000001

#define _CNFC_CNFC12_POSITION                    0x0000000C
#define _CNFC_CNFC12_MASK                        0x00001000
#define _CNFC_CNFC12_LENGTH                      0x00000001

#define _CNFC_CNFC13_POSITION                    0x0000000D
#define _CNFC_CNFC13_MASK                        0x00002000
#define _CNFC_CNFC13_LENGTH                      0x00000001

#define _CNFC_CNFC14_POSITION                    0x0000000E
#define _CNFC_CNFC14_MASK                        0x00004000
#define _CNFC_CNFC14_LENGTH                      0x00000001

#define _CNFC_CNFC15_POSITION                    0x0000000F
#define _CNFC_CNFC15_MASK                        0x00008000
#define _CNFC_CNFC15_LENGTH                      0x00000001

#define _SRCON0C_SR0C1_POSITION                  0x00000001
#define _SRCON0C_SR0C1_MASK                      0x00000002
#define _SRCON0C_SR0C1_LENGTH                    0x00000001

#define _SRCON0C_SR0C2_POSITION                  0x00000002
#define _SRCON0C_SR0C2_MASK                      0x00000004
#define _SRCON0C_SR0C2_LENGTH                    0x00000001

#define _SRCON0C_SR0C3_POSITION                  0x00000003
#define _SRCON0C_SR0C3_MASK                      0x00000008
#define _SRCON0C_SR0C3_LENGTH                    0x00000001

#define _SRCON0C_SR0C4_POSITION                  0x00000004
#define _SRCON0C_SR0C4_MASK                      0x00000010
#define _SRCON0C_SR0C4_LENGTH                    0x00000001

#define _SRCON0C_SR0C12_POSITION                 0x0000000C
#define _SRCON0C_SR0C12_MASK                     0x00001000
#define _SRCON0C_SR0C12_LENGTH                   0x00000001

#define _SRCON0C_SR0C13_POSITION                 0x0000000D
#define _SRCON0C_SR0C13_MASK                     0x00002000
#define _SRCON0C_SR0C13_LENGTH                   0x00000001

#define _SRCON0C_SR0C14_POSITION                 0x0000000E
#define _SRCON0C_SR0C14_MASK                     0x00004000
#define _SRCON0C_SR0C14_LENGTH                   0x00000001

#define _SRCON0C_SR0C15_POSITION                 0x0000000F
#define _SRCON0C_SR0C15_MASK                     0x00008000
#define _SRCON0C_SR0C15_LENGTH                   0x00000001

#define _SRCON1C_SR1C1_POSITION                  0x00000001
#define _SRCON1C_SR1C1_MASK                      0x00000002
#define _SRCON1C_SR1C1_LENGTH                    0x00000001

#define _SRCON1C_SR1C2_POSITION                  0x00000002
#define _SRCON1C_SR1C2_MASK                      0x00000004
#define _SRCON1C_SR1C2_LENGTH                    0x00000001

#define _SRCON1C_SR1C3_POSITION                  0x00000003
#define _SRCON1C_SR1C3_MASK                      0x00000008
#define _SRCON1C_SR1C3_LENGTH                    0x00000001

#define _SRCON1C_SR1C4_POSITION                  0x00000004
#define _SRCON1C_SR1C4_MASK                      0x00000010
#define _SRCON1C_SR1C4_LENGTH                    0x00000001

#define _SRCON1C_SR1C12_POSITION                 0x0000000C
#define _SRCON1C_SR1C12_MASK                     0x00001000
#define _SRCON1C_SR1C12_LENGTH                   0x00000001

#define _SRCON1C_SR1C13_POSITION                 0x0000000D
#define _SRCON1C_SR1C13_MASK                     0x00002000
#define _SRCON1C_SR1C13_LENGTH                   0x00000001

#define _SRCON1C_SR1C14_POSITION                 0x0000000E
#define _SRCON1C_SR1C14_MASK                     0x00004000
#define _SRCON1C_SR1C14_LENGTH                   0x00000001

#define _SRCON1C_SR1C15_POSITION                 0x0000000F
#define _SRCON1C_SR1C15_MASK                     0x00008000
#define _SRCON1C_SR1C15_LENGTH                   0x00000001

#define _ANSELD_ANSD14_POSITION                  0x0000000E
#define _ANSELD_ANSD14_MASK                      0x00004000
#define _ANSELD_ANSD14_LENGTH                    0x00000001

#define _ANSELD_ANSD15_POSITION                  0x0000000F
#define _ANSELD_ANSD15_MASK                      0x00008000
#define _ANSELD_ANSD15_LENGTH                    0x00000001

#define _ANSELD_w_POSITION                       0x00000000
#define _ANSELD_w_MASK                           0xFFFFFFFF
#define _ANSELD_w_LENGTH                         0x00000020

#define _TRISD_TRISD0_POSITION                   0x00000000
#define _TRISD_TRISD0_MASK                       0x00000001
#define _TRISD_TRISD0_LENGTH                     0x00000001

